In [11]:
import pandas as pd

In [16]:
Dicionario_01 = {
    'Nome':['Alice','Julia','Bruna','Daniel','Filipe','Silvio'],
    'Idade':['19','22','28','34','28','48'],
    'Profissões':['Direito','Engenharia','Enfermangem','Engenheiro Civil',
                  'Cientista da Computação','Engenheiro Eletrônico'],
    'ID':['1','2','3','4','5','6']
}

In [17]:
df1 = pd.DataFrame(Dicionario_01)

In [19]:
df1.head()

     Nome Idade               Profissões ID
0   Alice    19                  Direito  1
1   Julia    22               Engenharia  2
2   Bruna    28              Enfermangem  3
3  Daniel    34         Engenheiro Civil  4
4  Filipe    28  Cientista da Computação  5

In [20]:
Dic_01 = {
    'num_pro_fabric':['50','30','40','100'],
    'setores':['1','2','3','4']
}

In [21]:
df1 = pd.DataFrame(Dic_01)

In [23]:
df1.head()

  num_pro_fabric setores
0             50       1
1             30       2
2             40       3
3            100       4

In [24]:
Dic_01 = {
    'id':['1','2','3','4'],
    'nome':['Ana','Pedro','Maria','João'],
    'setores':['Rh','Vendas','Administrativo','Produção']
}
Dic_02 = {
    'id':['1','2','3','4'],
    'salario':['3000','2800','3200','2500']
}
Label_01 =['1 Linha','2 Linha','3 Linha','4 Linha']
Label_02 =['5 Linha','6 Linha','7 Linha','8 Linha']

In [26]:
df1 = pd.DataFrame(Dic_01,index=Label_01)
df2 = pd.DataFrame(Dic_02,index=Label_02)

In [27]:
df1.head()

        id   nome         setores
1 Linha  1    Ana              Rh
2 Linha  2  Pedro          Vendas
3 Linha  3  Maria  Administrativo
4 Linha  4   João        Produção

In [28]:
df2.head()

        id salario
5 Linha  1    3000
6 Linha  2    2800
7 Linha  3    3200
8 Linha  4    2500

In [29]:
df_n2 = pd.merge(df1,df2,how='inner')

In [30]:
df_n2.head()

  id   nome         setores salario
0  1    Ana              Rh    3000
1  2  Pedro          Vendas    2800
2  3  Maria  Administrativo    3200
3  4   João        Produção    2500